Repository: WahBun/AllYouNeedIsWheel
Catalog: ios/Wheel/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Manage TP / SL
zh_hans: 管理 TP / SL

source: Position TP / SL
zh_hans: 持仓 TP / SL

source: Optional TP / SL · GTC
zh_hans: TP / SL 独立可选 · GTC

source: Enable TP
zh_hans: 启用止盈 TP

source: Enable SL
zh_hans: 启用止损 SL

source: TP input
zh_hans: 止盈输入方式

source: Distance
zh_hans: 价差

source: Target price
zh_hans: 目标价

source: Profit %
zh_hans: 获利百分比

source: SL distance
zh_hans: 止损价差

source: SL target price
zh_hans: 止损目标价

source: Confirm replacing protection
zh_hans: 确认重建退出订单

source: Apply TP / SL
zh_hans: 应用 TP / SL

source: Cancel all TP / SL
zh_hans: 撤销全部 TP / SL

source: Back
zh_hans: 返回

source: Enter a positive value for each enabled exit.
zh_hans: 请为已启用的退出订单填写正数。

source: Profit % uses the entry premium before fees. A short option sold at 2.12 with 75% profit targets 0.53, rounded to the contract tick.
zh_hans: 获利百分比按开仓权利金计算，未计手续费。以 2.12 卖出期权，获利 75% 的目标买回价为 0.53，并按合约最小价位取整。

source: Existing exits will be canceled before replacement. Protection may be interrupted. A fill or uncertain response stops replacement; inspect the refreshed orders.
zh_hans: 先确认撤销旧退出单，再建立新单，期间可能没有保护。若出现成交或结果不明确，将停止重建，请核对刷新后的订单。

source: The selected exits will be canceled. Your position remains open. Check remaining orders after cancellation.
zh_hans: 将撤销选定的退出订单，持仓保留。撤单后请核对剩余订单。

source: Cancel TP?
zh_hans: 撤销止盈 TP？

source: Cancel SL?
zh_hans: 撤销止损 SL？

source: Remove TP; keep position
zh_hans: 撤销 TP，保留持仓

source: Remove SL; keep position
zh_hans: 撤销 SL，保留持仓

source: Account mode
zh_hans: 账户模式
zh_hant: 帳戶模式

source: Trading enabled
zh_hans: 允许提交订单
zh_hant: 允許提交訂單

source: Read only
zh_hans: 只读
zh_hant: 唯讀

source: Unknown
zh_hans: 未确认
zh_hant: 未確認

source: Disconnected
zh_hans: 未连接
zh_hant: 未連線

source: Filled
zh_hans: 已成交
zh_hant: 已成交

source: Position
zh_hans: 持仓
zh_hant: 持倉

source: Trim
zh_hans: 减仓
zh_hant: 減倉

source: Close
zh_hans: 平仓
zh_hant: 平倉

source: Working
zh_hans: 处理中
zh_hant: 處理中

source: Rejected
zh_hans: 被拒绝
zh_hant: 被拒絕

source: Canceled
zh_hans: 已取消
zh_hant: 已取消

source: Awaiting fill
zh_hans: 等待成交
zh_hant: 等待成交

source: Entry type
zh_hans: 入场类型
zh_hant: 進場類型

source: Shares
zh_hans: 股数
zh_hant: 股數

source: Join Bid
zh_hans: 取买价
zh_hant: 取買價

source: Join Ask
zh_hans: 取卖价
zh_hant: 取賣價

source: Chart details
zh_hans: 图表说明
zh_hant: 圖表說明

source: ETH includes available extended-hours data. Time: New York.
zh_hans: ETH 包含可用的延长时段行情。时间：纽约。
zh_hant: ETH 包含可用的延長時段行情。時間：紐約。

source: Interval
zh_hans: 周期
zh_hant: 週期

source: Session
zh_hans: 交易时段
zh_hant: 交易時段

source: Entry reference
zh_hans: 参考入场价
zh_hant: 參考進場價

source: Loading chart…
zh_hans: 正在加载图表…
zh_hant: 正在載入圖表…

source: Chart updates paused · verify connection
zh_hans: 图表更新暂停 · 请检查连接
zh_hant: 圖表更新暫停 · 請檢查連線

source: IB Last ticks · display batches ≈250ms
zh_hans: IB 逐笔成交 · 约 250ms 批量显示
zh_hant: IB 逐筆成交 · 約 250ms 批次顯示

source: Historical bars · waiting for IB Last ticks
zh_hans: 历史 K 线 · 等待 IB 逐笔成交
zh_hant: 歷史 K 線 · 等待 IB 逐筆成交

source: Diagnostics
zh_hans: 诊断信息

source: Preview diagnostics
zh_hans: 预览诊断信息

source: Diagnostics copied
zh_hans: 已复制诊断信息

source: Copy diagnostics
zh_hans: 复制诊断信息

source: Includes app version, refresh status and request reference only. No account, positions, private address or credentials.
zh_hans: 仅包含应用版本、刷新状态和请求编号，不含账户、持仓、私人地址或凭据。

source: Final result not yet verified. Absence from pending orders does not confirm a fill or cancellation.
zh_hans: 最终结果尚待核实。订单移出待处理列表，不代表已成交或撤单成功。

source: Estimate
zh_hans: 预估

source: Estimated change
zh_hans: 预计变化

source: Update the backend to enable entry margin estimates.
zh_hans: 请更新后端以启用开仓保证金预估。

source: Margin estimate does not match the selected order.
zh_hans: 保证金预估与所选订单不一致。

source: IB what-if estimate in USD, not cash collateral. Positive adds required margin; negative reduces it. Changes with account positions and market conditions; no order is submitted.
zh_hans: IB What-if 美元预估，并非现金担保金额。正数表示增加所需保证金，负数表示减少；会随账户持仓和行情变化，不会提交订单。

source: Reported shares differ from current holdings. This cost snapshot does not describe the current position.
zh_hans: 报表股数与当前持仓不同，这份成本快照不能代表当前持仓成本。

# %@ · %@ · Qty %@ · %@
source: %1$@ · %2$@ · Qty %3$@ · %4$@
zh_hans: %@ · %@ · 数量 %@ · %@
zh_hant: %@ · %@ · 數量 %@ · %@

# %@ · %@ %@ · %@ · %@ · %@ Limit %@ · %@ %@
source: %1$@ · %2$@ %3$@ · %4$@ · %5$@ · %6$@ Limit %7$@ · %8$@ %9$@
zh_hans: %@ · %@ %@ · %@ · %@ · %@ 限价 %@ · %@ %@
zh_hant: %@ · %@ %@ · %@ · %@ · %@ 限價 %@ · %@ %@

source: %@ shares
zh_hans: %@ 股
zh_hant: %@ 股

source: ● Portfolio
zh_hans: ● 投资组合
zh_hant: ● 投資組合

source: 1. Keep Tailscale connected on both devices.
zh_hans: 1. 保持两台设备的 Tailscale 已连接。
zh_hant: 1. 保持兩台設備的 Tailscale 已連接。

source: 2. Sign in to screen sharing with the Mini macOS account and password, not your IB account.
zh_hans: 2. 使用 Mini 的 macOS 用户名和密码登录屏幕共享，此处不是 IB 账户。
zh_hant: 2. 使用 Mini 的 macOS 用戶名和密碼登錄屏幕共享，此處不是 IB 賬戶。

source: 3. In Gateway, enter your IB password and complete IB Key verification on your phone.
zh_hans: 3. 在 Gateway 输入 IB 密码，在手机上完成 IB Key 验证。
zh_hant: 3. 在 Gateway 輸入 IB 密碼，在手機上完成 IB Key 驗證。

source: 4. Return to Wheel and tap Connect. Closing the remote viewer does not require quitting Gateway.
zh_hans: 4. 返回 Wheel 点击连接。关闭远程查看窗口即可，无需退出 Gateway。
zh_hant: 4. 返回 Wheel 點擊連接。關閉遠程查看窗口即可，無需退出 Gateway。

source: A confirmed working order owned by this API client is required
zh_hans: 只能修改当前连接提交且经 IB 确认的挂单
zh_hant: 只能修改目前連線提交且經 IB 確認的掛單

source: A private HTTPS backend address is required.
zh_hans: 需要填写私有 HTTPS 后端地址。
zh_hant: 需要填寫私有 HTTPS 後端地址。

source: A successful response confirms backend access, not live market data. Frozen or missing prices can reflect the market session, subscriptions or broker data permissions. Check the quote timestamp and Gateway status before deciding what to restart.
zh_hans: 成功响应只表示后端可访问，并不保证行情实时更新。冻结或缺失的价格可能与交易时段、行情订阅或券商数据权限有关。请先核对报价时间和 Gateway 状态，再判断是否需要重启。

source: A writable IB connection is required
zh_hans: 需要可交易的 IB 连接
zh_hant: 需要可交易的 IB 連線

source: Access & Feedback
zh_hans: 权限与建议
zh_hant: 權限與建議

source: Account
zh_hans: 账户
zh_hant: 帳戶

source: Account base currency · IBKR daily P&L
zh_hans: 以账户基础货币计价 · IBKR 当日盈亏
zh_hant: 以帳戶基礎貨幣計價 · IBKR 當日損益

source: Action
zh_hans: 操作
zh_hant: 操作

source: Add
zh_hans: 添加
zh_hant: 新增

source: Add ticker
zh_hans: 添加标的
zh_hant: 新增標的

source: All
zh_hans: 全部
zh_hant: 全部

source: ALL
zh_hans: 全部
zh_hant: 全部

source: Allocation
zh_hans: 资产配置
zh_hant: 資產配置

source: Annualized premium estimate
zh_hans: 年化权利金估算
zh_hant: 年化權利金估算

source: Another modification is pending
zh_hans: 已有改单正在等待确认
zh_hant: 已有改單正在等待確認

source: App
zh_hans: 应用

source: Appearance
zh_hans: 显示
zh_hant: 顯示

source: Apply
zh_hans: 应用
zh_hant: 應用

source: Aurora
zh_hans: 极光
zh_hant: 極光

source: Auto refresh · about 1 second
zh_hans: 自动刷新 · 约 1 秒
zh_hant: 自動重新整理 · 約 1 秒

source: Auto refresh paused
zh_hans: 自动刷新已暂停
zh_hant: 自動重新整理已暫停

source: Available coverage
zh_hans: 可用覆盖合约数
zh_hant: 可用覆蓋合約數

source: Average cost
zh_hans: 平均成本
zh_hant: 平均成本

source: Average fill price
zh_hans: 平均成交价
zh_hant: 平均成交價

source: Awaiting an updated broker status. Processing does not mean filled.
zh_hans: 等待券商状态更新；处理中不代表已成交。

source: Awaiting the first daily report for this period
zh_hans: 等待本周期首份日报；当前显示基准点
zh_hant: 等待本週期首份日報；目前顯示基準點

source: Backend responding
zh_hans: 后端有响应

source: Backend unavailable. Check your connection and Tailscale.
zh_hans: 后端暂不可用，请检查网络及 Tailscale 连接。
zh_hant: 後端暫不可用，請檢查網絡及 Tailscale 連接。

source: Broker order changed during review
zh_hans: 核对期间券商订单已变化
zh_hant: 核對期間券商訂單已變化

source: Broker order is not in a modifiable state
zh_hans: 券商订单当前状态不允许修改
zh_hant: 券商訂單目前狀態不允許修改

source: Broker order terms changed; verify in IB before modifying
zh_hans: 券商订单内容已变化，请先在 IB 核实
zh_hant: 券商訂單內容已變化，請先在 IB 核實

# BUY %@ %@ at %@ SELL %@ %@ · %@ · %@ at %@ Execution is separate in Orders.
source: BUY %1$@ %2$@ at %3$@ SELL %4$@ %5$@ · %6$@ · %7$@ at %8$@ Execution is separate in Orders.
zh_hans: 买入 %@ %@，价格 %@ 卖出 %@ %@ · %@ · %@，价格 %@ 请在订单页分别执行。
zh_hant: 買入 %@ %@，價格 %@ 賣出 %@ %@ · %@ · %@，價格 %@ 請在訂單頁分別執行。

source: Cached history · refresh pending
zh_hans: 当前显示缓存历史数据 · 等待刷新
zh_hant: 目前顯示快取歷史資料 · 等待重新整理

source: Cancel eligible orders
zh_hans: 撤销可撤订单
zh_hant: 撤銷可撤訂單

source: Cancel order
zh_hans: 撤单
zh_hant: 撤單

source: Canceled. Any earlier fills remain valid.
zh_hans: 已撤单，此前发生的成交仍然有效。

source: Cancellation requested; fills remain possible until IB confirms cancellation.
zh_hans: 已申请撤单；IB 确认撤单前仍有可能成交。

source: Cannot reach the backend. Check the address and Tailscale connection.
zh_hans: 无法连接后端，请检查地址及 Tailscale 连接。
zh_hant: 無法連接後端，請檢查地址及 Tailscale 連接。

source: Cash
zh_hans: 现金
zh_hant: 現金

source: Cash required
zh_hans: 所需现金
zh_hant: 所需現金

source: Cash-secured put
zh_hans: 现金担保 Put
zh_hant: 現金擔保 Put

source: Cash-secured puts
zh_hans: 现金担保 Put
zh_hant: 現金擔保 Put

source: Changing the overnight route requires canceling and recreating the order
zh_hans: 切换隔夜交易须先撤单，再重新创建订单
zh_hant: 切換隔夜交易須先撤單，再重新建立訂單

source: Check quote time
zh_hans: 请核对报价时间
zh_hant: 請核對報價時間

source: Check Tailscale, automatic date and time, and this HTTPS address in Safari. Do not bypass certificate verification.
zh_hans: 请检查 Tailscale、系统自动日期与时间，并在 Safari 打开相同的 HTTPS 地址。不要跳过证书验证。

source: Check the exact order in IB and the web app, including fills and pending orders. Clearing this lock does not cancel or resubmit anything.
zh_hans: 请在 IB 和网页版核对具体订单，包括成交与挂单。解除锁定不会撤单或重新提交。
zh_hant: 請在 IB 和網頁版核對具體訂單，包括成交與掛單。解除鎖定不會撤單或重新提交。

source: Check Wi-Fi or cellular data and Tailscale first, then confirm the backend address and Mini service. A timeout alone cannot identify which connection failed.
zh_hans: 先检查 Wi-Fi 或蜂窝网络及 Tailscale，再确认后端地址和 Mini 服务。仅凭超时无法判断哪一段连接出现故障。

source: Choose another photo and try again.
zh_hans: 请选择其他图片后重试。
zh_hant: 請選擇其他圖片後重試。

source: Close covered CALLs before selling shares.
zh_hans: 卖出股票前，请先平仓对应的备兑看涨期权。
zh_hant: 賣出股票前，請先平倉對應的備兌看漲期權。

source: Close limit per share
zh_hans: 平仓每股限价
zh_hant: 平倉每股限價

source: Close quantity
zh_hans: 平仓数量
zh_hant: 平倉數量

source: Commission
zh_hans: 手续费
zh_hant: 手續費

source: Compare with
zh_hans: 对比基准
zh_hant: 比較基準

source: Confirm
zh_hans: 确认
zh_hant: 確認

source: Confirm demo action
zh_hans: 确认演示操作
zh_hant: 確認示範操作

source: Confirm execution and cancellation
zh_hans: 执行及撤单前确认
zh_hant: 執行及撤單前確認

source: Connect
zh_hans: 连接
zh_hant: 連線

source: Connect your backend in Settings.
zh_hans: 请在设置中连接后端。
zh_hant: 請在設定中連接後端。

source: CONNECTED
zh_hans: 已连接
zh_hant: 已連線

source: Connected backend · real orders may execute
zh_hans: 已连接后端 · 真实订单可能成交
zh_hant: 已連接後端 · 真實訂單可能成交

source: Connecting…
zh_hans: 连接中…
zh_hant: 連線中…

source: Connection
zh_hans: 连接
zh_hant: 連線

source: Connection interrupted. Retrying…
zh_hans: 连接中断，正在重试…
zh_hant: 連接中斷，正在重試…

source: Connection timed out. Check your network and Tailscale, then retry.
zh_hans: 连接超时，请检查网络与 Tailscale 后重试。
zh_hant: 連接超時，請檢查網絡與 Tailscale 後重試。

source: Contract
zh_hans: 合约
zh_hant: 合約

source: Contract mismatch
zh_hans: 合约信息不匹配。
zh_hant: 合約信息不匹配。

source: Contracts
zh_hans: 合约数量
zh_hant: 合約數量

source: Copied
zh_hans: 已复制
zh_hant: 已複製

source: Copy connection address
zh_hans: 复制连接地址
zh_hant: 複製連接地址

source: Copy the connection address into your VNC client, or use Screen Sharing on your Mac.
zh_hans: 请将连接地址复制到 VNC 客户端，或使用 Mac 的系统屏幕共享。
zh_hant: 請將連接地址複製到 VNC 客戶端，或使用 Mac 的系統屏幕共享。

source: Cost basis
zh_hans: 成本总额

source: Could not verify broker order; no modification sent
zh_hans: 无法核实券商订单，未发送修改
zh_hant: 無法核實券商訂單，未傳送修改

source: Coverage already reserved
zh_hans: 覆盖额度已占用
zh_hant: 覆蓋額度已佔用

source: Covered call
zh_hans: 备兑 Call
zh_hant: 備兌 Call

source: Covered calls
zh_hans: 备兑 Call
zh_hant: 備兌 Call

source: Covered-call quantity is locked; price and time in force may change
zh_hans: 备兑看涨期权数量已锁定，可修改价格和有效期
zh_hant: 備兌看漲期權數量已鎖定，可修改價格和有效期

source: Credit
zh_hans: 净收入
zh_hant: 淨收入

source: Current price
zh_hans: 当前价格
zh_hant: 目前價格

source: Current short option
zh_hans: 当前期权空仓
zh_hant: 目前期權空倉

source: Custom colors
zh_hans: 自定义颜色
zh_hant: 自定義顏色

source: Daily P&L
zh_hans: 当日盈亏
zh_hant: 當日損益

source: Dark
zh_hans: 深色
zh_hant: 深色

source: Data status
zh_hans: 数据状态

source: Debit
zh_hans: 净支出
zh_hant: 淨支出

source: Deep Space
zh_hans: 深蓝星空
zh_hant: 深藍星空

source: Demo
zh_hans: 演示
zh_hant: 示範

source: DEMO
zh_hans: 演示
zh_hant: 示範

source: Demo estimate · not broker data
zh_hans: 演示估算 · 非券商数据
zh_hant: 示範估算 · 非券商資料

source: Demo fill details
zh_hans: 演示成交详情
zh_hant: 示範成交詳情

source: Demo quote
zh_hans: 演示报价
zh_hant: 示範報價

source: Demo updated. No broker request was sent.
zh_hans: 演示数据已更新，未向券商发送请求。
zh_hant: 示範資料已更新，未向券商傳送請求。

source: Difference
zh_hans: 差额
zh_hant: 差額

source: Dismiss notification
zh_hans: 关闭通知
zh_hant: 關閉通知

source: Do not resubmit. Verify in IB and the web app; trading is locked pending review.
zh_hans: 请勿重复提交。请在 IB 和网页端核实；交易已锁定，等待核查。
zh_hant: 請勿重復提交。請在 IB 和網頁端覈實；交易已鎖定，等待核查。

source: Done
zh_hans: 完成
zh_hant: 完成

source: English lettering
zh_hans: 英文点缀
zh_hant: 英文點綴

source: Enter your private HTTPS backend address in Settings.
zh_hans: 请在设置中输入你的私有 HTTPS 后端地址。
zh_hant: 請在設置中輸入你的私有 HTTPS 後端地址。

source: Entry premium · not realized profit
zh_hans: 开仓权利金 · 非已实现利润
zh_hant: 開倉權利金 · 非已實現利潤

source: Estimate margin impact
zh_hans: 查询保证金影响
zh_hant: 查詢保證金影響

source: Estimated closing impact
zh_hans: 预计平仓影响
zh_hant: 預計平倉影響

source: Estimated net value
zh_hans: 按持仓估算净值
zh_hant: 按持倉估算淨值

source: Estimated P&L before fees
zh_hans: 预计盈亏（未扣费用）
zh_hant: 預計損益（未扣費用）

source: Excess liquidity
zh_hans: 剩余流动性
zh_hant: 剩餘流動性

source: Execute
zh_hans: 执行
zh_hant: 執行

source: Executed records
zh_hans: 已执行记录
zh_hant: 已執行記錄

source: Expiration
zh_hans: 到期日
zh_hant: 到期日

source: Expiring this Friday
zh_hans: 本周五到期
zh_hant: 本週五到期

source: Feedback
zh_hans: 意见反馈
zh_hant: 意見回饋

# Filled %@ / %@ · %@
source: Filled %1$@ / %2$@ · %3$@
zh_hans: 已成交 %@ / %@ · %@
zh_hant: 已成交 %@ / %@ · %@

source: Filled. Review the recorded fill quantity and price.
zh_hans: 已成交，请核对记录中的成交数量和价格。

source: Frozen
zh_hans: 冻结
zh_hant: 凍結

source: FROZEN
zh_hans: 冻结行情
zh_hant: 凍結行情

source: Frozen portfolio · verify quote
zh_hans: 冻结数据 · 请核对报价
zh_hant: 凍結資料 · 請核對報價

source: Gateway average cost
zh_hans: Gateway 平均成本

source: Golden Peaks
zh_hans: 黑金山峦
zh_hant: 黑金山巒

source: Half
zh_hans: 一半
zh_hant: 一半

source: Have you verified the order in IB and the web app?
zh_hans: 已在 IB 和网页版核对订单了吗？
zh_hant: 已在 IB 和網頁版核對訂單了嗎？

source: Held position no longer matches the closing direction
zh_hans: 当前持仓与平仓方向不再匹配
zh_hant: 目前持倉與平倉方向不再相符

source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

source: Hide liquidity and cash
zh_hans: 收起流动性和现金
zh_hant: 收起流動性和現金

source: History is still generating. Try Refresh shortly.
zh_hans: 历史数据仍在生成，请稍后刷新。
zh_hant: 歷史資料仍在產生，請稍後重新整理。

source: History: compounded daily IBKR TWR. SPX and NQ100: FRED daily price indices, excluding reinvested dividends. Intraday estimate uses daily P&L / last reported NAV; deposits, withdrawals and IB reset times may affect comparability. Final returns follow the next Flex report.
zh_hans: 历史收益按 IBKR 每日时间加权收益率（TWR）复利计算。SPX 与 NQ100 使用 FRED 每日价格指数，不含股息再投资。盘中收益按当日盈亏与最近报告净资产的比值估算；出入金及 IB 数据重置时间可能影响可比性。最终收益以下一份 Flex 报表为准。
zh_hant: 歷史報酬按 IBKR 每日時間加權報酬率（TWR）複利計算。SPX 與 NQ100 使用 FRED 每日價格指數，不含股息再投資。盤中報酬按當日損益與最近報告淨資產的比值估算；出入金及 IB 資料重設時間可能影響可比性。最終報酬以下一份 Flex 報表為準。

source: Holdings
zh_hans: 持仓
zh_hant: 持倉

source: I have verified the order outcome
zh_hans: 我已核对订单结果
zh_hant: 我已核對訂單結果

source: IB order ID
zh_hans: IB 订单 ID
zh_hant: IB 訂單 ID

source: IB preflight did not approve the quantity increase
zh_hans: IB 预检查未通过，无法增加数量
zh_hant: IB 預檢查未通過，無法增加數量

source: IB reports account-level margin, not an exact allocation per holding. Position estimates are hypothetical changes and must not be added together.
zh_hans: IB 提供账户级保证金，而非逐笔精确分摊。各持仓估算是假设变化，不可相加。
zh_hant: IB 提供帳戶級保證金，而非逐筆精確分攤。各持倉估算是假設變化，不可相加。

source: IB reports the order as working; this is not a fill confirmation.
zh_hans: IB 显示订单正在工作，这不代表已经成交。

source: IB-managed and unknown orders are excluded. Stops on the first failure. Cancellation remains pending until IB confirms it.
zh_hans: 不包含 IB 管理和状态未知的订单。首次失败即停止；收到 IB 确认前，撤单仍处于待确认状态。
zh_hant: 不包含 IB 管理和狀態未知的訂單。首次失敗即停止；收到 IB 確認前，撤單仍處於待確認狀態。

source: IB-managed order. Modify or cancel in IB.
zh_hans: IB 管理的订单，请在 IB 中修改或撤销。
zh_hant: IB 管理的訂單，請在 IB 中修改或撤銷。

source: IBKR reported cost
zh_hans: IBKR 报表成本

source: If typing is incorrect, select ABC on Mini and check Caps Lock. Use Mini's Accessibility Keyboard if needed. Test ordinary text before typing a password.
zh_hans: 输入异常时，在 Mini 选择 ABC 并检查大写锁定；必要时使用 Mini 的辅助功能键盘。先用普通文字测试，再输入密码。
zh_hant: 輸入異常時，在 Mini 選擇 ABC 並檢查大寫鎖定；必要時使用 Mini 的輔助功能鍵盤。先用普通文字測試，再輸入密碼。

source: Import background
zh_hans: 导入背景
zh_hant: 導入背景

source: Initial margin
zh_hans: 初始保证金
zh_hant: 初始保證金

source: Initial margin change
zh_hans: 初始保证金变化
zh_hant: 初始保證金變化

source: Ink Mountains
zh_hans: 水墨山景
zh_hant: 水墨山景

source: Intraday estimate
zh_hans: 盘中估算收益率
zh_hant: 盤中估算報酬率

source: Invalid backend address.
zh_hans: 后端地址无效。
zh_hant: 後端網址無效。

source: Invalid backend response.
zh_hans: 后端响应无效。
zh_hant: 後端響應無效。

source: Invalid response.
zh_hans: 响应无效。
zh_hant: 伺服器回應無效。

source: Invalid time in force
zh_hans: 订单有效期无效
zh_hant: 訂單有效期無效

source: Keyboard and access
zh_hans: 键盘与访问权限
zh_hant: 鍵盤與訪問權限

source: Language
zh_hans: 语言
zh_hant: 語言

source: Last backend response
zh_hans: 上次后端响应

source: Last fill time
zh_hans: 最后成交时间
zh_hant: 最後成交時間

source: Last refreshed
zh_hans: 最近成功刷新
zh_hant: 最近成功重新整理

source: Leave runner
zh_hans: 留一张
zh_hant: 留一張

source: Leverage
zh_hans: 杠杆占比
zh_hant: 槓桿佔比

source: Light
zh_hans: 浅色
zh_hant: 淺色

source: Limit
zh_hans: 限价
zh_hant: 限價

source: Limit per share
zh_hans: 每股限价
zh_hant: 每股限價

source: Limit price
zh_hans: 限价
zh_hant: 限價

source: Limit price must be positive and finite
zh_hans: 限价必须为有效正数
zh_hant: 限價必須為有效正數

source: Limit total
zh_hans: 限价总额
zh_hant: 限價總額

source: Limited history for this period
zh_hans: 此时间范围内的历史数据不完整
zh_hant: 此時間範圍內的歷史資料不完整

source: Live
zh_hans: 实盘
zh_hant: 實盤

source: Loading opportunities…
zh_hans: 正在加载交易机会…
zh_hant: 正在載入交易機會…

source: Local draft. Not yet sent to IB.
zh_hans: 本地草稿，尚未发送给 IB。

source: Loss
zh_hans: 亏损
zh_hant: 虧損

source: Maintenance margin change
zh_hans: 维持保证金变化
zh_hant: 維持保證金變化

source: Margin details
zh_hans: 保证金明细
zh_hant: 保證金明細

source: Margin impact
zh_hans: 保证金影响
zh_hant: 保證金影響

source: Market closed · quotes are not live
zh_hans: 休市 · 非实时报价
zh_hant: 休市 · 非即時報價

source: Market hours unavailable · automatic quotes paused
zh_hans: 交易时段状态不可用 · 自动报价已暂停
zh_hant: 交易時段狀態不可用 · 自動報價已暫停

source: Market session unavailable
zh_hans: 暂时无法获取交易时段。
zh_hant: 暫時無法獲取交易時段。

source: Market value
zh_hans: 市值
zh_hant: 市值

source: Mini must allow your macOS account to observe and control the screen. Use Standard sharing; no public port forwarding is needed.
zh_hans: Mini 必须允许你的 macOS 账户观察和控制屏幕。使用标准共享即可，无需公网端口转发。
zh_hant: Mini 必須允許你的 macOS 賬戶觀察和控制屏幕。使用標準共享即可，無需公網端口轉發。

source: Mini screen sharing
zh_hans: Mini 屏幕共享
zh_hant: Mini 屏幕共享

source: Minimum iOS
zh_hans: 最低 iOS 版本
zh_hant: 最低 iOS 版本

source: Modification awaiting confirmation; displayed terms may still be the previous terms.
zh_hans: 修改正在等待确认；当前显示的参数可能仍是修改前的值。

source: Moonlit Coast
zh_hans: 月夜海岸
zh_hant: 月夜海岸

source: MTD
zh_hans: 本月
zh_hant: 本月

source: My background
zh_hans: 我的背景
zh_hant: 我的背景

source: Negative means less required margin; positive means more. Closing a hedge can increase margin. This is not the holding's actual margin allocation.
zh_hans: 负数表示所需保证金减少，正数表示增加。平掉对冲持仓可能增加保证金。这不是该持仓的实际占用。
zh_hant: 負數表示所需保證金減少，正數表示增加。平掉對沖持倉可能增加保證金。這不是該持倉的實際佔用。

source: Neon City
zh_hans: 赛博都市
zh_hant: 賽博都市

source: Net liquidation
zh_hans: 账户净值
zh_hant: 帳戶淨值

source: Net premium before fees
zh_hans: 净权利金（未扣费用）
zh_hant: 淨權利金（未扣費用）

source: New option · SELL TO OPEN · DAY
zh_hans: 新合约 · SELL TO OPEN · DAY
zh_hant: 新合約 · SELL TO OPEN · DAY

source: No compatible screen sharing app
zh_hans: 没有兼容的屏幕共享应用
zh_hant: 沒有兼容的屏幕共享應用

source: No expiration available.
zh_hans: 暂无可用到期日。
zh_hant: 暫無可用到期日。

source: No internet connection. Check Wi-Fi or cellular data.
zh_hans: 网络未连接，请检查 Wi-Fi 或蜂窝数据。
zh_hant: 網絡未連接，請檢查 Wi-Fi 或蜂窩數據。

source: No matching option quote.
zh_hans: 没有匹配的期权报价。
zh_hant: 沒有匹配的期權報價。

source: No opportunities
zh_hans: 暂无交易机会
zh_hant: 暫無交易機會

source: No orders
zh_hans: 暂无订单
zh_hant: 暫無訂單

source: No portfolio
zh_hans: 暂无持仓数据
zh_hant: 暫無持倉資料

source: Official report snapshot. Live Gateway cost and P&L below use a separate basis; recent trades may not yet be included.
zh_hans: 官方报表快照。下方实时 Gateway 成本与盈亏使用另一口径，最近的交易可能尚未计入报表。

source: On Mac, use Screen Sharing. On iPhone, a compatible VNC client is required; Wheel does not include a remote desktop client.
zh_hans: Mac 请使用系统屏幕共享；iPhone 需要兼容的 VNC 客户端。Wheel 不内置远程桌面。
zh_hant: Mac 請使用系統屏幕共享；iPhone 需要兼容的 VNC 客戶端。Wheel 不內置遠程桌面。

source: Only exact short option positions can be rolled.
zh_hans: 只能对明确匹配的期权空头持仓进行移仓。
zh_hant: 只能對明確匹配的期權空頭持倉進行移倉。

source: Open limit per share
zh_hans: 开仓每股限价
zh_hant: 開倉每股限價

source: Open screen sharing
zh_hans: 打开屏幕共享
zh_hant: 打開屏幕共享

source: Option data unavailable.
zh_hans: 暂时无法获取期权数据。
zh_hant: 暫時無法獲取期權數據。

source: Options
zh_hans: 期权
zh_hant: 期權

source: Order changed; refresh and review before modifying
zh_hans: 订单已变化，请刷新核对后再修改
zh_hant: 訂單已變化，請重新整理核對後再修改

source: Order filled
zh_hans: 全部成交
zh_hant: 全部成交

source: Order filled or changed during review; refresh before modifying
zh_hans: 核对期间订单已成交或变化，请刷新后再修改
zh_hant: 核對期間訂單已成交或變化，請重新整理後再修改

source: Order is not ready for modification; verify its broker state
zh_hans: 当前订单无法修改，请核实券商状态
zh_hant: 目前訂單無法修改，請核實券商狀態

source: Order modification confirmed
zh_hans: 改单已确认
zh_hant: 改單已確認

source: Order modification unconfirmed. Verify in IB; do not retry.
zh_hans: 改单结果尚未确认。请在 IB 核实，勿重复提交。
zh_hant: 改單結果尚未確認。請在 IB 核實，勿重複提交。

source: Order no longer exists.
zh_hans: 该订单已不存在。
zh_hant: 該訂單已不存在。

source: Order outcome needs verification in IB and the web app.
zh_hans: 请在 IB 和网页端核实订单结果。
zh_hant: 請在 IB 和網頁端覈實訂單結果。

source: Order refresh failed; displayed data may be outdated.
zh_hans: 订单刷新失败，当前显示的数据可能已过期。
zh_hant: 訂單刷新失敗，當前顯示的數據可能已過期。

source: Order rejected or inactive. Check the broker details.
zh_hans: 订单已被拒绝或处于非活动状态，请查看券商详情。

source: Order status could not be verified.
zh_hans: 无法确认订单状态。
zh_hant: 無法確認訂單狀態。

source: Order status needs verification
zh_hans: 订单状态需要核实
zh_hant: 訂單狀態需要核實

source: Orders
zh_hans: 订单
zh_hant: 訂單

source: OVT · Overnight session only. Requires broker permission and an eligible stock.
zh_hans: OVT · 仅限单次隔夜时段，需券商权限及标的支持。
zh_hant: OVT · 僅限單次隔夜時段，需券商權限及標的支援。

source: Partially filled
zh_hans: 部分成交
zh_hant: 部分成交

source: Partially filled; the remaining quantity is not yet confirmed filled.
zh_hans: 已部分成交；剩余数量尚未确认成交。

source: Pending
zh_hans: 待处理
zh_hant: 待處理

source: Performance
zh_hans: 收益表现
zh_hant: 收益表現

source: Performance endpoint unavailable.
zh_hans: 收益接口暂不可用。
zh_hant: 收益資料服務暫時無法使用。

source: Performance requires a live backend with Flex history.
zh_hans: 收益表现需要连接已配置 Flex 历史数据的真实后端。
zh_hant: 收益表現需要連接已設定 Flex 歷史資料的實際後端。

source: Period
zh_hans: 时间范围
zh_hant: 時間範圍

source: Permanent ID
zh_hans: 永久 ID
zh_hant: 永久 ID

source: Portfolio
zh_hans: 投资组合
zh_hant: 投資組合

source: Portfolio only
zh_hans: 仅投资组合
zh_hant: 僅投資組合

source: Position changed. Return to Portfolio and review.
zh_hans: 持仓已变化，请返回投资组合重新查看。
zh_hant: 持倉已變化，請返回投資組合重新查看。

source: Position quantity changed. Review the close quantity.
zh_hans: 持仓数量已变化，请核对平仓数量。
zh_hant: 持倉數量已變化，請核對平倉數量。

source: Position quote is invalid. Refresh before staging.
zh_hans: 持仓报价无效，请刷新后再暂存订单。
zh_hant: 持倉報價無效，請刷新後再暫存訂單。

source: Positions
zh_hans: 持仓数量
zh_hant: 持倉數量

source: Positive assets
zh_hans: 正资产
zh_hant: 正資產

source: Premium
zh_hans: 权利金
zh_hant: 權利金

source: Preview only. No order was submitted or changed.
zh_hans: 仅供预览，没有提交或更改任何订单。
zh_hant: 僅供預覽，沒有提交或更改任何訂單。

source: Profit
zh_hans: 盈利
zh_hant: 盈利

source: Put notional
zh_hans: Put 名义金额
zh_hant: Put 名義金額
